//
//  Common.swift
//  where-is-bus
//
//  Created by art-off on 05.10.2020.
//  Copyright © 2020 art-off. All rights reserved.
//

import Foundation

class Common {
    
    static let json = """
{
    "1": {
        "2": {
            "A": {
                "first": "Дом ученых",
                "last": "Автовокзал «Восточный» (площадка отстоя)",
                "ts_count": 8,
                "mark": " "
            },
            "B": {
                "first": "Автовокзал «Восточный» (площадка отстоя)",
                "last": "Дом ученых",
                "ts_count": 10,
                "mark": " "
            }
        },
        "3": {
            "A": {
                "first": "Автовокзал «Восточный» (площадка отстоя)",
                "last": "Студенческий городок",
                "ts_count": 11,
                "mark": " "
            },
            "B": {
                "first": "Студенческий городок",
                "last": "Автовокзал «Восточный» (площадка отстоя)",
                "ts_count": 9,
                "mark": " "
            }
        },
        "5": {
            "A": {
                "first": "ОАО «Красфарма»",
                "last": "Сельхозкомплекс",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "Сельхозкомплекс",
                "last": "ОАО «Красфарма»",
                "ts_count": 5,
                "mark": " "
            }
        },
        "6": {
            "A": {
                "first": "мкрн. Покровский (ул. Чернышевского)",
                "last": "ДК «Кировский»",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "ДК «Кировский»",
                "last": "мкрн. Покровский (ул. Чернышевского)",
                "ts_count": 6,
                "mark": " "
            }
        },
        "7": {
            "A": {
                "first": "ст.Красноярск-Северный",
                "last": "ДК «Кировский»",
                "ts_count": 5,
                "mark": " "
            },
            "B": {
                "first": "ДК «Кировский»",
                "last": "ст.Красноярск-Северный",
                "ts_count": 3,
                "mark": " "
            }
        },
        "8": {
            "A": {
                "first": "ст.Красноярск-Северный",
                "last": "пос. Водников (конечная)",
                "ts_count": 9,
                "mark": " "
            },
            "B": {
                "first": "пос. Водников (конечная)",
                "last": "ст.Красноярск-Северный",
                "ts_count": 6,
                "mark": " "
            }
        },
        "9": {
            "A": {
                "first": "Междугородный автовокзал",
                "last": "мкрн Верхняя Базаиха",
                "ts_count": 5,
                "mark": " "
            },
            "B": {
                "first": "мкрн Верхняя Базаиха",
                "last": "Междугородный автовокзал",
                "ts_count": 9,
                "mark": " "
            }
        },
        "10": {
            "A": {
                "first": "ОАО «Красфарма»",
                "last": "пос. Энергетиков (конечная)",
                "ts_count": 4,
                "mark": " "
            },
            "B": {
                "first": "пос. Энергетиков (конечная)",
                "last": "ОАО «Красфарма»",
                "ts_count": 3,
                "mark": " "
            }
        },
        "11": {
            "A": {
                "first": "Мясокомбинат (ул. Норильская)",
                "last": "ул. 3-я Дальневосточная",
                "ts_count": 8,
                "mark": " "
            },
            "B": {
                "first": "ул. 3-я Дальневосточная",
                "last": "Мясокомбинат (ул. Норильская)",
                "ts_count": 7,
                "mark": " "
            }
        },
        "12": {
            "A": {
                "first": "ст.Красноярск-Северный",
                "last": "совхоз Удачный (конечная)",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "совхоз Удачный (конечная)",
                "last": "ст.Красноярск-Северный",
                "ts_count": 6,
                "mark": " "
            }
        },
        "14": {
            "A": {
                "first": "Железнодорожная больница",
                "last": "пос. Овинный",
                "ts_count": 1,
                "mark": " "
            },
            "B": {
                "first": "пос. Овинный",
                "last": "Железнодорожная больница",
                "ts_count": 1,
                "mark": " "
            }
        },
        "18": {
            "A": {
                "first": "Предмостная площадь (конечная)",
                "last": "мкрн. Верхние Черемушки (конечная)",
                "ts_count": 0,
                "mark": " "
            },
            "B": {
                "first": "мкрн. Верхние Черемушки (конечная)",
                "last": "Предмостная площадь (конечная)",
                "ts_count": 0,
                "mark": " "
            }
        },
        "19": {
            "A": {
                "first": "Стела",
                "last": "Причал",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "Причал",
                "last": "Стела",
                "ts_count": 7,
                "mark": " "
            }
        },
        "20": {
            "A": {
                "first": "Автовокзал «Восточный» (площадка отстоя)",
                "last": "Кардиоцентр",
                "ts_count": 10,
                "mark": " "
            },
            "B": {
                "first": "Кардиоцентр",
                "last": "Автовокзал «Восточный» (площадка отстоя)",
                "ts_count": 10,
                "mark": " "
            }
        },
        "22": {
            "A": {
                "first": "Спортзал",
                "last": "ИТК",
                "ts_count": 0,
                "mark": " "
            },
            "B": {
                "first": "ИТК",
                "last": "Спортзал",
                "ts_count": 1,
                "mark": " "
            }
        },
        "23": {
            "A": {
                "first": "мкрн. Солнечный (конечная)",
                "last": "ЛДК",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "ЛДК",
                "last": "мкрн. Солнечный (конечная)",
                "ts_count": 6,
                "mark": " "
            }
        },
        "26": {
            "A": {
                "first": "Железнодорожная больница",
                "last": "Плодово-ягодная станция",
                "ts_count": 2,
                "mark": " "
            },
            "B": {
                "first": "Плодово-ягодная станция",
                "last": "Железнодорожная больница",
                "ts_count": 3,
                "mark": " "
            }
        },
        "27": {
            "A": {
                "first": "Полигон (конечная)",
                "last": "мкрн. Преображенский (площадка отстоя)",
                "ts_count": 3,
                "mark": " "
            },
            "B": {
                "first": "мкрн. Преображенский (площадка отстоя)",
                "last": "Полигон (конечная)",
                "ts_count": 4,
                "mark": " "
            }
        },
        "31": {
            "A": {
                "first": "ЛДК",
                "last": "Академия биатлона",
                "ts_count": 3,
                "mark": " "
            },
            "B": {
                "first": "Академия биатлона",
                "last": "ЛДК",
                "ts_count": 6,
                "mark": " "
            }
        },
        "32": {
            "A": {
                "first": "Академия биатлона",
                "last": "ул. 3-я Дальневосточная",
                "ts_count": 5,
                "mark": " "
            },
            "B": {
                "first": "ул. 3-я Дальневосточная",
                "last": "Академия биатлона",
                "ts_count": 3,
                "mark": " "
            }
        },
        "36": {
            "A": {
                "first": "ЛДК",
                "last": "Железнодорожная больница",
                "ts_count": 1,
                "mark": " "
            },
            "B": {
                "first": "Железнодорожная больница",
                "last": "ЛДК",
                "ts_count": 3,
                "mark": " "
            }
        },
        "37": {
            "A": {
                "first": "Железнодорожный вокзал",
                "last": "пос. Базаиха",
                "ts_count": 2,
                "mark": " "
            },
            "B": {
                "first": "пос. Базаиха",
                "last": "Железнодорожный вокзал",
                "ts_count": 3,
                "mark": " "
            }
        },
        "38": {
            "A": {
                "first": "пос. Таймыр (конечная)",
                "last": "Дом ученых",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "Дом ученых",
                "last": "пос. Таймыр (конечная)",
                "ts_count": 5,
                "mark": " "
            }
        },
        "40": {
            "A": {
                "first": "Предмостная площадь (конечная)",
                "last": "Полигон (конечная)",
                "ts_count": 0,
                "mark": " "
            },
            "B": {
                "first": "Полигон (конечная)",
                "last": "Предмостная площадь (конечная)",
                "ts_count": 0,
                "mark": " "
            }
        },
        "43": {
            "A": {
                "first": "Автовокзал «Восточный» (площадка отстоя)",
                "last": "Сельхозкомплекс",
                "ts_count": 7,
                "mark": " "
            },
            "B": {
                "first": "Сельхозкомплекс",
                "last": "Автовокзал «Восточный» (площадка отстоя)",
                "ts_count": 6,
                "mark": " "
            }
        },
        "49": {
            "A": {
                "first": "Кардиоцентр",
                "last": "Спорткомплекс «Радуга»",
                "ts_count": 7,
                "mark": " "
            },
            "B": {
                "first": "Спорткомплекс «Радуга»",
                "last": "Кардиоцентр",
                "ts_count": 7,
                "mark": " "
            }
        },
        "50": {
            "A": {
                "first": "Стела",
                "last": "ул. Соколовская",
                "ts_count": 7,
                "mark": " "
            },
            "B": {
                "first": "ул. Соколовская",
                "last": "Стела",
                "ts_count": 7,
                "mark": " "
            }
        },
        "51": {
            "A": {
                "first": "Спортзал",
                "last": "Госпиталь ВОВ (Площадка отстоя)",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "Госпиталь ВОВ (Площадка отстоя)",
                "last": "Спортзал",
                "ts_count": 4,
                "mark": " "
            }
        },
        "52": {
            "A": {
                "first": "ЛДК",
                "last": "Мясокомбинат",
                "ts_count": 5,
                "mark": " "
            },
            "B": {
                "first": "Мясокомбинат",
                "last": "ЛДК",
                "ts_count": 7,
                "mark": " "
            }
        },
        "53": {
            "A": {
                "first": "Сельхозкомплекс",
                "last": "ул. Рокоссовского",
                "ts_count": 8,
                "mark": " "
            },
            "B": {
                "first": "ул. Рокоссовского",
                "last": "Сельхозкомплекс",
                "ts_count": 7,
                "mark": " "
            }
        },
        "55": {
            "A": {
                "first": "пос. Цементников",
                "last": "Железнодорожный вокзал",
                "ts_count": 9,
                "mark": " "
            },
            "B": {
                "first": "Железнодорожный вокзал",
                "last": "пос. Цементников",
                "ts_count": 6,
                "mark": " "
            }
        },
        "56": {
            "A": {
                "first": "пос. Шинников (конечная)",
                "last": "Железнодорожный вокзал",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "Железнодорожный вокзал",
                "last": "пос. Шинников (конечная)",
                "ts_count": 6,
                "mark": " "
            }
        },
        "58": {
            "A": {
                "first": "Поликлиника (ул. Саянская)",
                "last": "Спортзал",
                "ts_count": 5,
                "mark": " "
            },
            "B": {
                "first": "Спортзал",
                "last": "Поликлиника (ул. Саянская)",
                "ts_count": 5,
                "mark": " "
            }
        },
        "60": {
            "A": {
                "first": "Автовокзал «Восточный» (площадка отстоя)",
                "last": "мкрн. Солнечный (конечная)",
                "ts_count": 7,
                "mark": " "
            },
            "B": {
                "first": "мкрн. Солнечный (конечная)",
                "last": "Автовокзал «Восточный» (площадка отстоя)",
                "ts_count": 6,
                "mark": " "
            }
        },
        "61": {
            "A": {
                "first": "мкрн. Солнечный (конечная)",
                "last": "пос. Шинников (конечная)",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "пос. Шинников (конечная)",
                "last": "мкрн. Солнечный (конечная)",
                "ts_count": 4,
                "mark": " "
            }
        },
        "63": {
            "A": {
                "first": "мкрн. Солнечный (ул. Светлова)",
                "last": "Академгородок",
                "ts_count": 7,
                "mark": " "
            },
            "B": {
                "first": "Академгородок",
                "last": "мкрн. Солнечный (ул. Светлова)",
                "ts_count": 6,
                "mark": " "
            }
        },
        "64": {
            "A": {
                "first": "Железнодорожный вокзал",
                "last": "мкрн. Солнечный (конечная)",
                "ts_count": 5,
                "mark": " "
            },
            "B": {
                "first": "мкрн. Солнечный (конечная)",
                "last": "Железнодорожный вокзал",
                "ts_count": 8,
                "mark": " "
            }
        },
        "65": {
            "A": {
                "first": "Агротерминал",
                "last": "ДК «Кировский»",
                "ts_count": 7,
                "mark": " "
            },
            "B": {
                "first": "ДК «Кировский»",
                "last": "Агротерминал",
                "ts_count": 4,
                "mark": " "
            }
        },
        "71": {
            "A": {
                "first": "Спортзал",
                "last": "пос. Таймыр (конечная)",
                "ts_count": 7,
                "mark": " "
            },
            "B": {
                "first": "пос. Таймыр (конечная)",
                "last": "Спортзал",
                "ts_count": 9,
                "mark": " "
            }
        },
        "76": {
            "A": {
                "first": "мкрн. Покровский (ул. Чернышевского)",
                "last": "Жилой комплекс «Ясный»",
                "ts_count": 1,
                "mark": " "
            },
            "B": {
                "first": "Жилой комплекс «Ясный»",
                "last": "мкрн. Покровский (ул. Чернышевского)",
                "ts_count": 0,
                "mark": " "
            }
        },
        "77": {
            "A": {
                "first": "д. Песчанка (конечная)",
                "last": "Железнодорожная больница",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "Железнодорожная больница",
                "last": "д. Песчанка (конечная)",
                "ts_count": 6,
                "mark": " "
            }
        },
        "78": {
            "A": {
                "first": "Контейнерный двор",
                "last": "Стела",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "Стела",
                "last": "Контейнерный двор",
                "ts_count": 6,
                "mark": " "
            }
        },
        "80": {
            "A": {
                "first": "пос. Таймыр (конечная)",
                "last": "Платинум Арена",
                "ts_count": 8,
                "mark": " "
            },
            "B": {
                "first": "Платинум Арена",
                "last": "пос. Таймыр (конечная)",
                "ts_count": 6,
                "mark": " "
            }
        },
        "81": {
            "A": {
                "first": "Железнодорожный вокзал",
                "last": "ООО «Сибирский элемент»",
                "ts_count": 8,
                "mark": " "
            },
            "B": {
                "first": "ООО «Сибирский элемент»",
                "last": "Железнодорожный вокзал",
                "ts_count": 7,
                "mark": " "
            }
        },
        "83": {
            "A": {
                "first": "Профилакторий з-да КраМЗ",
                "last": "Дом ученых",
                "ts_count": 8,
                "mark": " "
            },
            "B": {
                "first": "Дом ученых",
                "last": "Профилакторий з-да КраМЗ",
                "ts_count": 6,
                "mark": " "
            }
        },
        "85": {
            "A": {
                "first": "Сельхозкомплекс",
                "last": "мкрн. Верхние Черемушки (конечная)",
                "ts_count": 12,
                "mark": " "
            },
            "B": {
                "first": "мкрн. Верхние Черемушки (конечная)",
                "last": "Сельхозкомплекс",
                "ts_count": 12,
                "mark": " "
            }
        },
        "87": {
            "A": {
                "first": "мкрн. Солнечный (конечная)",
                "last": "Мясокомбинат (ул. Норильская)",
                "ts_count": 7,
                "mark": " "
            },
            "B": {
                "first": "Мясокомбинат (ул. Норильская)",
                "last": "мкрн. Солнечный (конечная)",
                "ts_count": 8,
                "mark": " "
            }
        },
        "88": {
            "A": {
                "first": "Спортзал",
                "last": "Академия биатлона",
                "ts_count": 5,
                "mark": " "
            },
            "B": {
                "first": "Академия биатлона",
                "last": "Спортзал",
                "ts_count": 5,
                "mark": " "
            }
        },
        "90": {
            "A": {
                "first": "Академия биатлона",
                "last": "мкрн Верхняя Базаиха",
                "ts_count": 12,
                "mark": " "
            },
            "B": {
                "first": "мкрн Верхняя Базаиха",
                "last": "Академия биатлона",
                "ts_count": 11,
                "mark": " "
            }
        },
        "91": {
            "A": {
                "first": "Сельхозкомплекс",
                "last": "Агротерминал",
                "ts_count": 7,
                "mark": " "
            },
            "B": {
                "first": "Агротерминал",
                "last": "Сельхозкомплекс",
                "ts_count": 7,
                "mark": " "
            }
        },
        "92": {
            "A": {
                "first": "ОАО «Красфарма»",
                "last": "Химкомбинат «Енисей»",
                "ts_count": 9,
                "mark": " "
            },
            "B": {
                "first": "Химкомбинат «Енисей»",
                "last": "ОАО «Красфарма»",
                "ts_count": 9,
                "mark": " "
            }
        },
        "94": {
            "A": {
                "first": "ЛДК",
                "last": "ТЭЦ-3",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "ТЭЦ-3",
                "last": "ЛДК",
                "ts_count": 10,
                "mark": " "
            }
        },
        "95": {
            "A": {
                "first": "ЛДК",
                "last": "мкрн. Верхние Черемушки (конечная)",
                "ts_count": 6,
                "mark": " "
            },
            "B": {
                "first": "мкрн. Верхние Черемушки (конечная)",
                "last": "ЛДК",
                "ts_count": 7,
                "mark": " "
            }
        },
        "98": {
            "A": {
                "first": "ЛДК",
                "last": "ОАО «РУСАЛ»",
                "ts_count": 7,
                "mark": " "
            },
            "B": {
                "first": "ОАО «РУСАЛ»",
                "last": "ЛДК",
                "ts_count": 9,
                "mark": " "
            }
        },
        "99": {
            "A": {
                "first": "ст.Красноярск-Северный",
                "last": "ул. Цимлянская (Площадка отстоя)",
                "ts_count": 8,
                "mark": " "
            },
            "B": {
                "first": "ул. Цимлянская (Площадка отстоя)",
                "last": "ст.Красноярск-Северный",
                "ts_count": 11,
                "mark": " "
            }
        },
        "18с": {
            "A": {
                "first": "ОАО «Красфарма»",
                "last": "Сады",
                "ts_count": 0,
                "mark": " "
            },
            "B": {
                "first": "Сады",
                "last": "ОАО «Красфарма»",
                "ts_count": 1,
                "mark": " "
            }
        },
        "40а": {
            "A": {
                "first": "Автовокзал «Восточный» (площадка отстоя)",
                "last": "Полигон (конечная)",
                "ts_count": 0,
                "mark": " "
            },
            "B": {
                "first": "Полигон (конечная)",
                "last": "Автовокзал «Восточный» (площадка отстоя)",
                "ts_count": 0,
                "mark": " "
            }
        },
        "40с": {
            "A": {
                "first": "ул. Московская, 32/2 (площадка отстоя)",
                "last": "Полигон (конечная)",
                "ts_count": 0,
                "mark": " "
            },
            "B": {
                "first": "Полигон (конечная)",
                "last": "ул. Московская, 32/2 (площадка отстоя)",
                "ts_count": 1,
                "mark": " "
            }
        },
        "СФУ": {
            "A": {
                "first": "Сибирский федеральный университет",
                "last": "Студенческий городок",
                "ts_count": 0,
                "mark": " "
            },
            "B": {
                "first": "Студенческий городок",
                "last": "Сибирский федеральный университет",
                "ts_count": 0,
                "mark": " "
            }
        }
    },
    "2": {
        "4т": {
            "A": {
                "first": "Железнодорожный вокзал",
                "last": "Северо-западный район",
                "ts_count": 2,
                "mark": " "
            },
            "B": {
                "first": "Северо-западный район",
                "last": "Железнодорожный вокзал",
                "ts_count": 3,
                "mark": " "
            }
        },
        "5т": {
            "A": {
                "first": "Студенческий городок",
                "last": "ст.Красноярск-Северный",
                "ts_count": 9,
                "mark": " "
            },
            "B": {
                "first": "ст.Красноярск-Северный",
                "last": "Студенческий городок",
                "ts_count": 4,
                "mark": " "
            }
        },
        "7т": {
            "A": {
                "first": "Железнодорожный вокзал",
                "last": "Спортзал",
                "ts_count": 3,
                "mark": " "
            },
            "B": {
                "first": "Спортзал",
                "last": "Железнодорожный вокзал",
                "ts_count": 2,
                "mark": " "
            }
        },
        "13т": {
            "A": {
                "first": "Железнодорожный вокзал",
                "last": "Северо-западный район",
                "ts_count": 3,
                "mark": " "
            },
            "B": {
                "first": "Северо-западный район",
                "last": "Железнодорожный вокзал",
                "ts_count": 2,
                "mark": " "
            }
        },
        "15т": {
            "A": {
                "first": "5-й мкрн. (мкрн. Ветлужанка)",
                "last": "ОАО «РУСАЛ»",
                "ts_count": 9,
                "mark": " "
            },
            "B": {
                "first": "ОАО «РУСАЛ»",
                "last": "5-й мкрн. (мкрн. Ветлужанка)",
                "ts_count": 7,
                "mark": " "
            }
        }
    },
    "3": {
        "4тр": {
            "A": {
                "first": "КрасТЭЦ",
                "last": "Предмостная площадь",
                "ts_count": 4,
                "mark": " "
            },
            "B": {
                "first": "Предмостная площадь",
                "last": "КрасТЭЦ",
                "ts_count": 4,
                "mark": " "
            }
        },
        "5тр": {
            "A": {
                "first": "Предмостная площадь",
                "last": "пос. Энергетиков",
                "ts_count": 1,
                "mark": " "
            },
            "B": {
                "first": "пос. Энергетиков",
                "last": "Предмостная площадь",
                "ts_count": 3,
                "mark": " "
            }
        },
        "6тр": {
            "A": {
                "first": "Предмостная площадь",
                "last": "пос. Энергетиков",
                "ts_count": 2,
                "mark": " "
            },
            "B": {
                "first": "пос. Энергетиков",
                "last": "Предмостная площадь",
                "ts_count": 6,
                "mark": " "
            }
        },
        "7тр": {
            "A": {
                "first": "КрасТЭЦ",
                "last": "Предмостная площадь",
                "ts_count": 7,
                "mark": " "
            },
            "B": {
                "first": "Предмостная площадь",
                "last": "КрасТЭЦ",
                "ts_count": 2,
                "mark": " "
            }
        }
    },
    "4": {
        "6440": {
            "A": {
                "first": "ст. Красноярск",
                "last": "ст. Заозёрная",
                "ts_count": 0,
                "mark": " "
            }
        }
    }
}
"""
    
}
